"""
Излишняя автоматизация

«Повторение — мать учения!» и «Если это можно автоматизировать — автоматизируй!»
Этим принципам следуют многие программисты. Но что будет, если их объединить?

Формат ввода
Одна строка — весьма полезная информация.

Формат вывода
Трижды повторённая весьма полезная информация.

Ввод:
2 + 2 = 4

Вывод:
2 + 2 = 4
2 + 2 = 4
2 + 2 = 4
"""

a = str(input())
print(f"{a}\n" * 2, a, sep="") 





