"""
Объектно-ориентированное программирование (ООП) позволяет устранить недостатки процедурного подхода. 

Язык программирования Python является объектно-ориентированным. Это означает, что каждая сущность 
(переменная, функция и так далее) в этом языке является объектом определенного класса.
Ранее мы говорили, что, например, целое число является в Python типом данных int. На самом деле есть класс целых чисел int.

Убедимся в этом, написав простую программу:
"""
print(type(1))
# <class 'int'>

"""
Синтаксис создания класса в Python выглядит следующим образом:

class <ИмяКласса>:
    <описание класса>
Имя класса по стандарту PEP8 записывается в стиле CapWords (каждое слово с прописной буквы).
"""

